leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_bf.h
/** \brief  Length for Ifx_CAN_MO_CTR_Bits.SETTXEN1 */
#define IFX_CAN_MO_CTR_SETTXEN1_LEN (1u)

/** \brief  Mask for Ifx_CAN_MO_CTR_Bits.SETTXEN1 */
#define IFX_CAN_MO_CTR_SETTXEN1_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_MO_CTR_Bits.SETTXEN1 */
#define IFX_CAN_MO_CTR_SETTXEN1_OFF (26u)

/** \brief  Length for Ifx_CAN_MO_CTR_Bits.SETTXPND */
#define IFX_CAN_MO_CTR_SETTXPND_LEN (1u)

/** \brief  Mask for Ifx_CAN_MO_CTR_Bits.SETTXPND */
#define IFX_CAN_MO_CTR_SETTXPND_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_MO_CTR_Bits.SETTXPND */
#define IFX_CAN_MO_CTR_SETTXPND_OFF (17u)

/** \brief  Length for Ifx_CAN_MO_CTR_Bits.SETTXRQ */
#define IFX_CAN_MO_CTR_SETTXRQ_LEN (1u)

/** \brief  Mask for Ifx_CAN_MO_CTR_Bits.SETTXRQ */
#define IFX_CAN_MO_CTR_SETTXRQ_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_MO_CTR_Bits.SETTXRQ */
#define IFX_CAN_MO_CTR_SETTXRQ_OFF (24u)

/** \brief  Length for Ifx_CAN_MO_DATAH_Bits.DB4 */
#define IFX_CAN_MO_DATAH_DB4_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_DATAH_Bits.DB4 */
#define IFX_CAN_MO_DATAH_DB4_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_DATAH_Bits.DB4 */
#define IFX_CAN_MO_DATAH_DB4_OFF (0u)

/** \brief  Length for Ifx_CAN_MO_DATAH_Bits.DB5 */
#define IFX_CAN_MO_DATAH_DB5_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_DATAH_Bits.DB5 */
#define IFX_CAN_MO_DATAH_DB5_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_DATAH_Bits.DB5 */
#define IFX_CAN_MO_DATAH_DB5_OFF (8u)

/** \brief  Length for Ifx_CAN_MO_DATAH_Bits.DB6 */
#define IFX_CAN_MO_DATAH_DB6_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_DATAH_Bits.DB6 */
#define IFX_CAN_MO_DATAH_DB6_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_DATAH_Bits.DB6 */
#define IFX_CAN_MO_DATAH_DB6_OFF (16u)

/** \brief  Length for Ifx_CAN_MO_DATAH_Bits.DB7 */
#define IFX_CAN_MO_DATAH_DB7_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_DATAH_Bits.DB7 */
#define IFX_CAN_MO_DATAH_DB7_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_DATAH_Bits.DB7 */
#define IFX_CAN_MO_DATAH_DB7_OFF (24u)

/** \brief  Length for Ifx_CAN_MO_DATAL_Bits.DB0 */
#define IFX_CAN_MO_DATAL_DB0_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_DATAL_Bits.DB0 */
#define IFX_CAN_MO_DATAL_DB0_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_DATAL_Bits.DB0 */
#define IFX_CAN_MO_DATAL_DB0_OFF (0u)

/** \brief  Length for Ifx_CAN_MO_DATAL_Bits.DB1 */
#define IFX_CAN_MO_DATAL_DB1_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_DATAL_Bits.DB1 */
#define IFX_CAN_MO_DATAL_DB1_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_DATAL_Bits.DB1 */
#define IFX_CAN_MO_DATAL_DB1_OFF (8u)

/** \brief  Length for Ifx_CAN_MO_DATAL_Bits.DB2 */
#define IFX_CAN_MO_DATAL_DB2_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_DATAL_Bits.DB2 */
#define IFX_CAN_MO_DATAL_DB2_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_DATAL_Bits.DB2 */
#define IFX_CAN_MO_DATAL_DB2_OFF (16u)

/** \brief  Length for Ifx_CAN_MO_DATAL_Bits.DB3 */
#define IFX_CAN_MO_DATAL_DB3_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_DATAL_Bits.DB3 */
#define IFX_CAN_MO_DATAL_DB3_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_DATAL_Bits.DB3 */
#define IFX_CAN_MO_DATAL_DB3_OFF (24u)

/** \brief  Length for Ifx_CAN_MO_EDATA0_Bits.DB0 */
#define IFX_CAN_MO_EDATA0_DB0_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA0_Bits.DB0 */
#define IFX_CAN_MO_EDATA0_DB0_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA0_Bits.DB0 */
#define IFX_CAN_MO_EDATA0_DB0_OFF (0u)

/** \brief  Length for Ifx_CAN_MO_EDATA0_Bits.DB1 */
#define IFX_CAN_MO_EDATA0_DB1_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA0_Bits.DB1 */
#define IFX_CAN_MO_EDATA0_DB1_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA0_Bits.DB1 */
#define IFX_CAN_MO_EDATA0_DB1_OFF (8u)

/** \brief  Length for Ifx_CAN_MO_EDATA0_Bits.DB2 */
#define IFX_CAN_MO_EDATA0_DB2_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA0_Bits.DB2 */
#define IFX_CAN_MO_EDATA0_DB2_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA0_Bits.DB2 */
#define IFX_CAN_MO_EDATA0_DB2_OFF (16u)

/** \brief  Length for Ifx_CAN_MO_EDATA0_Bits.DB3 */
#define IFX_CAN_MO_EDATA0_DB3_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA0_Bits.DB3 */
#define IFX_CAN_MO_EDATA0_DB3_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA0_Bits.DB3 */
#define IFX_CAN_MO_EDATA0_DB3_OFF (24u)

/** \brief  Length for Ifx_CAN_MO_EDATA1_Bits.DB0 */
#define IFX_CAN_MO_EDATA1_DB0_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA1_Bits.DB0 */
#define IFX_CAN_MO_EDATA1_DB0_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA1_Bits.DB0 */
#define IFX_CAN_MO_EDATA1_DB0_OFF (0u)

/** \brief  Length for Ifx_CAN_MO_EDATA1_Bits.DB1 */
#define IFX_CAN_MO_EDATA1_DB1_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA1_Bits.DB1 */
#define IFX_CAN_MO_EDATA1_DB1_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA1_Bits.DB1 */
#define IFX_CAN_MO_EDATA1_DB1_OFF (8u)

/** \brief  Length for Ifx_CAN_MO_EDATA1_Bits.DB2 */
#define IFX_CAN_MO_EDATA1_DB2_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA1_Bits.DB2 */
#define IFX_CAN_MO_EDATA1_DB2_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA1_Bits.DB2 */
#define IFX_CAN_MO_EDATA1_DB2_OFF (16u)

/** \brief  Length for Ifx_CAN_MO_EDATA1_Bits.DB3 */
#define IFX_CAN_MO_EDATA1_DB3_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA1_Bits.DB3 */
#define IFX_CAN_MO_EDATA1_DB3_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA1_Bits.DB3 */
#define IFX_CAN_MO_EDATA1_DB3_OFF (24u)

/** \brief  Length for Ifx_CAN_MO_EDATA2_Bits.DB0 */
#define IFX_CAN_MO_EDATA2_DB0_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA2_Bits.DB0 */
#define IFX_CAN_MO_EDATA2_DB0_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA2_Bits.DB0 */
#define IFX_CAN_MO_EDATA2_DB0_OFF (0u)

/** \brief  Length for Ifx_CAN_MO_EDATA2_Bits.DB1 */
#define IFX_CAN_MO_EDATA2_DB1_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA2_Bits.DB1 */
#define IFX_CAN_MO_EDATA2_DB1_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA2_Bits.DB1 */
#define IFX_CAN_MO_EDATA2_DB1_OFF (8u)

/** \brief  Length for Ifx_CAN_MO_EDATA2_Bits.DB2 */
#define IFX_CAN_MO_EDATA2_DB2_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA2_Bits.DB2 */
#define IFX_CAN_MO_EDATA2_DB2_MSK (0xffu)

